export type QuoteModel = {
  id: number;
  name: string;
  business_need_label: string;
  features: string[];
  addons: Addon[];
  price: number;
  description: string;
};

type Addon = {
  id: number;
  price: number;
  name: string;
};

export const quotesData: QuoteModel[] = [
  {
    id: 1,
    name: "real-estate",
    business_need_label: "real-estate_business_need",
    addons: [
      { name: "أضافة 1", price: 10, id: 1 },
      { name: "أضافة 2", price: 12, id: 2 },
      { name: "أضافة 3", price: 15, id: 3 },
    ],
    features: [
      "عدد مستخدمين 1",
      "عدد العقارات/الوحدات غير محدودة",
      "عدد العقود غير محدود",
      "عدد العملاء غير محدودين",
      "فواتير إلكترونية يشمل",
      "المصروفات مستوى عقد/عقار",
      "العقود والتنبيهات شامل",
    ],
    price: 299,
    description:
      "صممت هذه الباقة لتلبية احتياجات العقاريين والملاك الأفراد وأصحاب المكاتب الناشئة، إذ تٌمكنهم من إدارة تحصيلات ومستحقات العقود، ومتابعة مصروفات العقار مع تنبيهات الدفعات وإنشاء سندات القبض آليًا، وإصدار الفواتير الإلكترونية المتوافقة مع معايير الهيئة، كما تزودهم بخاصيتي إخلاء الوحدات وتجديد العقود، كل هذا بإضافة عدد غير محدود من العقارات والوحدات، وعدد لا نهائي من العقود والمستأجرين.",
  },
  {
    id: 2,
    name: "offices",
    business_need_label: "offices_business_need",
    addons: [
      { name: "أضافة 1", price: 10, id: 1 },
      { name: "أضافة 2", price: 12, id: 2 },
      { name: "أضافة 3", price: 13, id: 3 },
      { name: "أضافة 4", price: 15, id: 4 },
    ],
    features: [
      "عدد مستخدمين 4",
      "جميع مميزات العقاري",
      "مؤشرات ورسوم بيانية يشمل",
      "نظام محاسبي آلي متكامل ",
      "تقارير تفصيلية مستوى وحدة/عقار",
      "نظام صيانة وتشغيل شامل",
    ],
    price: 499,
    description:
      "هذه الباقة مخصصة للوسطاء العقاريين المحترفين والمكاتب العقارية، لمتابعة العمليات اليومية بأتمتة كاملة لعمليات التأجير والتشغيل والصيانة ومتابعتها بتقارير تفصيلية قابلة للتخصيص، بالإضافة إلى شاشة المؤشرات الذكية، مع نظام محاسبي متكامل وفوترة آلية وإمكانية إصدار الفواتير وتوريد الضرائب نيابة عن طرف ثالث، وشاشة العقود المؤرشفة لمتابعة العقود المنتهية والملغية، وشاشة العقارات الشاغرة لمتابعة وحصر الوحدات الغير مؤجرة.",
  },
  {
    id: 3,
    name: "companies",
    business_need_label: "companies_business_need",
    addons: [
      { name: "أضافة 1", price: 10, id: 1 },
      { name: "أضافة 2", price: 15, id: 2 },
    ],
    features: [
      "عدد مستخدمين 10",
      "جميع مميزات المكاتب",
      "خدمات المستأجر الذاتية",
      "خدمات المالك الذاتية",
      "المدفوعات الألكترونية بطاقة مدى",
      "ذكاء إصطناعي متابعة صيانة/تحصيل",
      "تعلم الآلة اختيار صور/تصحيح اخطاء",
    ],
    price: 1999,
    description:
      "الباقة المثالية للشركات العقارية التي تنشط في قطاع إدارة الأملاك العقارية والتي يكون عدد موظفيها المختصين بإدارة الأملاك في نطاق 10 موظفين، وتتميز الباقة ببوابات الخدمات الذاتية لتسهيل التواصل مع المالك والمستأجر، بالإضافة إلى التقارير المجمعة، وخدمات الربط مع الأنظمة المختلفة وخدمة التسويق العقاري بتمكينهم من إنشاء عروض الأسعار. بالإضافة إلى تنظيم السماحية (السداد اللاحق)، مع دعم مختلف والقوائم المالية (قائمة الدخل، والتدفقات النقدية، والمركز المالي، والتغير في حقوق الملكية).",
  },
];
