export type QuoteModel = {
  id: number;
  name: string;
  business_need_label: string;
  features: string[];
  addons: Addon[];
  price: number;
  description: string;
};

export type QuoteModelV2 = {
  id: number;
  name: string;
  business_need_label: string;
  features: string[];
  price: number;
  description: string;
};

export type Addon = {
  id: number;
  price: number;
  name: string;
};

type AddOneRange = {
  name?: string;
  from: number;
  to: number;
  price: number;
};

export type AddonV2 = {
  id: number;
  price: number;
  name: string;
  logo?: string;
  description?: string;
  addonType: AddonType;
  data: AddOneRange[];
};

export type AddonType = "DEFAULT" | "DROPDOWN" | "PLUS_MINUS";

export const quotesData: QuoteModel[] = [
  {
    id: 1,
    name: "real-estate",
    business_need_label: "personal_needed",
    addons: [
      { name: "أضافة 1", price: 10, id: 1 },
      { name: "أضافة 2", price: 12, id: 2 },
      { name: "أضافة 3", price: 15, id: 3 },
    ],
    features: [
      "1 :عدد مستخدمين",
      "عدد العقارات/الوحدات غير محدودة",
      "عدد العقود غير محدود",
      "عدد العملاء غير محدودين",
      "فواتير إلكترونية يشمل",
      "المصروفات مستوى عقد/عقار",
      "العقود والتنبيهات شامل",
    ],
    price: 199,
    description:
      "صممت هذه الباقة لتلبية احتياجات العقاريين والملاك الأفراد وأصحاب المكاتب الناشئة، إذ تٌمكنهم من إدارة تحصيلات ومستحقات العقود، ومتابعة مصروفات العقار مع تنبيهات الدفعات وإنشاء سندات القبض آليًا، وإصدار الفواتير الإلكترونية المتوافقة مع معايير الهيئة، كما تزودهم بخاصيتي إخلاء الوحدات وتجديد العقود، كل هذا بإضافة عدد غير محدود من العقارات والوحدات، وعدد لا نهائي من العقود والمستأجرين.",
  },
  {
    id: 2,
    name: "offices",
    business_need_label: "office_needed",
    addons: [
      { name: "أضافة 1", price: 10, id: 1 },
      { name: "أضافة 2", price: 12, id: 2 },
      { name: "أضافة 3", price: 13, id: 3 },
      { name: "أضافة 4", price: 15, id: 4 },
    ],
    features: [
      "عدد مستخدمين 4",
      "جميع مميزات العقاري",
      "مؤشرات ورسوم بيانية يشمل",
      "نظام محاسبي آلي متكامل ",
      "تقارير تفصيلية مستوى وحدة/عقار",
      "نظام صيانة وتشغيل شامل",
    ],
    price: 699,
    description:
      "هذه الباقة مخصصة للوسطاء العقاريين المحترفين والمكاتب العقارية، لمتابعة العمليات اليومية بأتمتة كاملة لعمليات التأجير والتشغيل والصيانة ومتابعتها بتقارير تفصيلية قابلة للتخصيص، بالإضافة إلى شاشة المؤشرات الذكية، مع نظام محاسبي متكامل وفوترة آلية وإمكانية إصدار الفواتير وتوريد الضرائب نيابة عن طرف ثالث، وشاشة العقود المؤرشفة لمتابعة العقود المنتهية والملغية، وشاشة العقارات الشاغرة لمتابعة وحصر الوحدات الغير مؤجرة.",
  },
  {
    id: 3,
    name: "companies",
    business_need_label: "company_needed",
    addons: [
      { name: "أضافة 1", price: 10, id: 1 },
      { name: "أضافة 2", price: 15, id: 2 },
    ],
    features: [
      "عدد مستخدمين 10",
      "جميع مميزات المكاتب",
      "خدمات المستأجر الذاتية",
      "خدمات المالك الذاتية",
      "المدفوعات الألكترونية بطاقة مدى",
      "ذكاء إصطناعي متابعة صيانة/تحصيل",
      "تعلم الآلة اختيار صور/تصحيح اخطاء",
    ],
    price: 1999,
    description:
      "الباقة المثالية للشركات العقارية التي تنشط في قطاع إدارة الأملاك العقارية والتي يكون عدد موظفيها المختصين بإدارة الأملاك في نطاق 10 موظفين، وتتميز الباقة ببوابات الخدمات الذاتية لتسهيل التواصل مع المالك والمستأجر، بالإضافة إلى التقارير المجمعة، وخدمات الربط مع الأنظمة المختلفة وخدمة التسويق العقاري بتمكينهم من إنشاء عروض الأسعار. بالإضافة إلى تنظيم السماحية (السداد اللاحق)، مع دعم مختلف والقوائم المالية (قائمة الدخل، والتدفقات النقدية، والمركز المالي، والتغير في حقوق الملكية).",
  },
];

export const quotesDataV2: QuoteModelV2[] = [
  {
    id: 1,
    name: "real-estate",
    business_need_label: "personal_needed",
    features: [
      "مستخدم واحد",
      "عقارات ووحدات غير محدودة",
      "عقود غير محدودة",
      "300 رسالة جوال",
      "14 تقرير تفصيلي للعقارات والوحدات",
      "مصاريف الوحدات العقارية",
      "متابعة التحصيل وإشعارات المستأجرين",
      "اخلاء الوحدة/التأمين",
      "فاتورة إلكترونية متوافقة مع متطلبات هيئة الزكاة",
    ],
    price: 199,
    description:
      "صممت هذه الباقة لتلبية احتياجات العقاريين والملاك الأفراد وأصحاب المكاتب الناشئة، إذ تٌمكنهم من إدارة تحصيلات ومستحقات العقود، ومتابعة مصروفات العقار مع تنبيهات الدفعات وإنشاء سندات القبض آليًا، وإصدار الفواتير الإلكترونية المتوافقة مع معايير الهيئة، كما تزودهم بخاصيتي إخلاء الوحدات وتجديد العقود، كل هذا بإضافة عدد غير محدود من العقارات والوحدات، وعدد لا نهائي من العقود والمستأجرين.",
  },
  {
    id: 2,
    name: "offices",
    business_need_label: "office_needed",
    features: [
      "4 مستخدمين",
      "عقارات ووحدات غير محدودة",
      "عقود ومستأجرين غير محدودة",
      "1000 رسالة جوال",
      "٣٦ تقرير تفصيلي للعقارات والوحدات",
      "مصاريف الوحدات العقارية",
      "متابعة التحصيل/إشعارات المستأجرين",
      "اخلاء الوحدة/التأمين",
      "فاتورة إلكترونية متوافقة مع متطلبات هيئة الزكاة",
      "الوحدات الشاغرة",
      "تجديد آلي وأرشفة للعقود",
      "شاشة مؤشرات ورسوم بيانية",
      "نظام صيانة الوحدات والمرافق",
      "نظام محاسبي مالي (أساسي)",
    ],
    price: 699,
    description:
      "هذه الباقة مخصصة للوسطاء العقاريين المحترفين والمكاتب العقارية، لمتابعة العمليات اليومية بأتمتة كاملة لعمليات التأجير والتشغيل والصيانة ومتابعتها بتقارير تفصيلية قابلة للتخصيص، بالإضافة إلى شاشة المؤشرات الذكية، مع نظام محاسبي متكامل وفوترة آلية وإمكانية إصدار الفواتير وتوريد الضرائب نيابة عن طرف ثالث، وشاشة العقود المؤرشفة لمتابعة العقود المنتهية والملغية، وشاشة العقارات الشاغرة لمتابعة وحصر الوحدات الغير مؤجرة.",
  },
  {
    id: 3,
    name: "companies",
    business_need_label: "company_needed",
    features: [
      "10 مستخدمين",
      "عقارات ووحدات غير محدودة",
      "عقود ومستأجرين غير محدودة",
      "5000 رسالة جوال",
      "36 تقرير تفصيلي للعقارات والوحدات",
      "مصاريف الوحدات العقارية",
      "متابعة التحصيل/إشعارات المستأجرين",
      "اخلاء الوحدة/التأمين",
      "فاتورة إلكترونية متوافقة مع متطلبات هيئة الزكاة",
      "الوحدات الشاغرة",
      "تجديد آلي وأرشفة للعقود",
      "شاشة مؤشرات ورسوم بيانية",
      "نظام صيانة الوحدات والمرافق",
      "نظام محاسبي مالي (متكامل)",
      "بوابة الخدمات الذاتية للمالك",
      "بوابة الخدمات الذاتية للمستأجر",
    ],
    price: 1999,
    description:
      "الباقة المثالية للشركات العقارية التي تنشط في قطاع إدارة الأملاك العقارية والتي يكون عدد موظفيها المختصين بإدارة الأملاك في نطاق 10 موظفين، وتتميز الباقة ببوابات الخدمات الذاتية لتسهيل التواصل مع المالك والمستأجر، بالإضافة إلى التقارير المجمعة، وخدمات الربط مع الأنظمة المختلفة وخدمة التسويق العقاري بتمكينهم من إنشاء عروض الأسعار. بالإضافة إلى تنظيم السماحية (السداد اللاحق)، مع دعم مختلف والقوائم المالية (قائمة الدخل، والتدفقات النقدية، والمركز المالي، والتغير في حقوق الملكية).",
  },
];

export const addonsData: AddonV2[] = [
  {
    id: 1,
    name: "أدخال العقود",
    price: 0,
    logo: "",
    addonType: "PLUS_MINUS",
    description: "وسع قنواتك التسويقية ومصادر العملاء",
    data: [
      {
        from: 0,
        to: 100,
        price: 10.0,
      },
      {
        from: 101,
        to: 500,
        price: 8.0,
      },
      {
        from: 501,
        to: 1000,
        price: 5.0,
      },
      {
        from: 1001,
        to: 2000,
        price: 2.5,
      },
    ],
  },
  {
    id: 2,
    name: "ادخال القيود",
    price: 0,
    logo: "",
    addonType: "PLUS_MINUS",
    description: "وسع قنواتك التسويقية ومصادر العملاء",
    data: [
      {
        from: 0,
        to: 100,
        price: 10.0,
      },
      {
        from: 101,
        to: 500,
        price: 8.0,
      },
      {
        from: 501,
        to: 1000,
        price: 5.0,
      },
      {
        from: 1001,
        to: 2000,
        price: 2.5,
      },
    ],
  },
  {
    id: 3,
    name: "عدد مستخدمين بوابات",
    price: 0,
    logo: "",
    addonType: "PLUS_MINUS",
    description: "وسع قنواتك التسويقية ومصادر العملاء",
    data: [
      {
        from: 0,
        to: 100,
        price: 50.0,
      },
      {
        from: 101,
        to: 500,
        price: 30.0,
      },
      {
        from: 501,
        to: 1000,
        price: 25.0,
      },
      {
        from: 1001,
        to: 2000,
        price: 20,
      },
    ],
  },
];
